In [20]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from config import shhh
engine = create_engine(f'postgresql://postgres:{shhh}@localhost:5432/employees_db')
connection = engine.connect()

In [21]:
salary_data = pd.read_sql("SELECT * FROM salaries", connection)
title_data = pd.read_sql("SELECT * FROM titles", connection)
employee_data = pd.read_sql("SELECT * FROM employees", connection)

In [22]:
salary_data_renamed = salary_data.rename(columns={"emp_no" : "Employee Number",
                                                  "salary" : "Salary",})

title_data_renamed = title_data.rename(columns={"title_id" : "Title ID",
                                                "title" : "Title",})

employee_data_renamed = employee_data.rename(columns={"emp_no" : "Employee Number",
                                                      "emp_title_id" : "Title ID",
                                                      "birth_date" : "Birth_Date",
                                                      "first_name" : "First Name",
                                                      "last_name" : "Last Name",
                                                      "sex" : "Sex",
                                                      "hire_date": "Hire Date"})

In [23]:
salary_data_renamed.head()

   Employee Number  Salary
0            10001   60117
1            10002   65828
2            10003   40006
3            10004   40054
4            10005   78228

In [24]:
title_data_renamed.head()

  Title ID               Title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [25]:
employee_data_renamed.head()

   Employee Number Title ID  Birth_Date  First Name  Last Name Sex   Hire Date
0           473302    s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1           475053    e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2            57444    e0002   1/30/1958       Berry       Babb   F   3/21/1992
3           421786    s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4           282238    e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [27]:
merged_employee_salary = pd.merge(employee_data_renamed, salary_data_renamed, on = 'Employee Number')
merged_all = pd.merge(merged_employee_salary, title_data_renamed, on = 'Title ID')
merged_all.head()

,Employee Number,Title ID,Birth_Date,First Name,Last Name,Sex,Hire Date,Salary,Title
0,473302,s0001,7/25/1953,Hideyuki,Zallocco,M,4/28/1990,40000,Staff
1,421786,s0001,9/28/1957,Xiong,Verhoeff,M,11/26/1987,40000,Staff
2,273487,s0001,4/14/1957,Christoph,Parfitt,M,6/28/1991,56087,Staff
3,246449,s0001,3/23/1958,Subbu,Bultermann,F,3/25/1988,87084,Staff
4,48085,s0001,1/19/1964,Venkatesan,Gilg,M,6/28/1993,63016,Staff